INSERT INTO SAPI.news (id, title, description, text, author, news_category_id, album_id, source, status, pub_approve, video, created_at, updated_at) VALUES (1, 'Флешмоб «Поздравь учителя!»', null, '<h2>В Киржачском районе проходит флешмоб &laquo;Поздравь учителя!&raquo;</h2>

<p>Флешмоб на День учителя давно уже стал одним из неординарных видов поздравления любимых педагогов с их профессиональным праздником. С одной стороны спонтанная и неожиданная, а с другой &ndash; хорошо подготовленная акция, в которой задействованы ученики одного или нескольких классов, отлично поднимает настроение всем и является прекрасным подарком для учителей.<br />
&laquo;5 октября &mdash; самое время поздравить своих педагогов, выразить им слова благодарности за их благородный труд.</p>

<p>Предлагаем принять участие во Флешмобе &laquo;Поздравь учителя!&raquo;</p>

<p>Варианты Флешмоба:</p>

<p>Флешмоб &laquo;Видео с поздравлением&raquo;</p>

<ol>
	<li>Сними короткий видеоролик со своим поздравлением: представься, поздравь любимого учителя с праздником, запусти эстафетный самолетик своим друзьям.</li>
	<li>Выложи свое видео в любую социальную сеть с хэштегами акции: #поздравьучителя #деньучителя #киржачскийрайон</li>
	<li>Под видео напиши поздравление любимому учителю. Укажи ссылки на друзей, которым ты передаешь эстафетный самолетик.</li>
</ol>

<p>Подробнее об акции можно узнать в официальной группе управления образования</p>

<p><a href="https://clck.ru/35szM9">Официальная группа образования</a></p>', 'Директор', 1, 7, null, 'active', '2023-10-01 00:00:00', null, '2023-10-17 02:08:48', '2023-10-17 02:45:38');
INSERT INTO SAPI.news (id, title, description, text, author, news_category_id, album_id, source, status, pub_approve, video, created_at, updated_at) VALUES (2, 'Посадка Сада памяти', null, '<p>В селе Филипповское высадили Сад памяти в честь героев СВО</p>', 'Директор', 1, 10, null, 'active', '2023-10-02 00:00:00', 'https://youtu.be/vHVCWP7-TQ4', '2023-10-17 02:16:20', '2023-10-17 02:16:45');
INSERT INTO SAPI.news (id, title, description, text, author, news_category_id, album_id, source, status, pub_approve, video, created_at, updated_at) VALUES (3, 'Онлайн конкурс "Родные места"', null, '<p>Юных художников зовут поучаствовать в онлайн-конкурсе</p>

<p>Ребятам предлагают нарисовать любимые и дорогие сердцу места родного края в любой живописной технике.</p>

<p>Конкурсную работу необходимо прислать на электронную почту: <a href="http://ddn.33@yandex.ru">ddn.33@yandex.ru</a> (с пометкой &laquo;Родные места&raquo;).</p>

<p>Победителей и призеров наградят памятными призами и дипломами. А лучшие работы войдут в коллекцию &laquo;Дома дружбы народов&raquo;.</p>

<p><strong>Конкурс продлится до 10 ноября</strong>. Узнать подробности можно в группе &laquo;Дома дружбы народов&raquo; или по телефону - <strong>8 (4922) 45-17-40</strong>.</p>', 'Директор', 2, 8, null, 'active', '2023-10-03 00:00:00', null, '2023-10-17 02:19:18', '2023-10-17 02:44:22');
INSERT INTO SAPI.news (id, title, description, text, author, news_category_id, album_id, source, status, pub_approve, video, created_at, updated_at) VALUES (4, 'Проверьте свою дорожную грамотность!', null, '<p>В рамках нацпроекта &laquo;Безопасные качественные дороги&raquo; стартовала Всероссийская олимпиада &laquo;Безопасные дороги&raquo;. Участвовать в ней могут ученики 1&ndash;9 классов.</p>

<p>Онлайн-соревнование поможет школьникам оценить, насколько хорошо они знают ПДД, разобраться, как правильно вести себя пешеходу, пассажиру, как безопасно управлять самокатом и велосипедом.</p>

<p>Олимпиада проходит на онлайн-платформе <a href="https://vk.cc/cqZYPe">учи.ру</a>.<br />
Всех участников ждут награды. Соревнование продлится до 15 октября</p>

<p><br />
<a href="https://vk.com/video-185852839_456239795">ссылка на ВК</a></p>', 'Директор', 1, 10, null, 'active', '2023-10-10 00:00:00', null, '2023-10-17 02:23:32', '2023-10-17 02:23:32');
INSERT INTO SAPI.news (id, title, description, text, author, news_category_id, album_id, source, status, pub_approve, video, created_at, updated_at) VALUES (5, 'III Форум классных руководителей', null, '<p>23 педагога Владимирской области в нынешнем году прошли серьезный экспертный отбор и отправились на III Форум классных руководителей. Всего на это знаковое событие Года педагога и наставника было подано более 60 000 заявок со всей страны!</p>

<p>Форум проводится Министерством Просвещения России по поручению Президента России. Стратегический партнер - АНО &laquo;Диалог Регионы&raquo;, головная организация Центров управления регионами.</p>

<p>Площадки форума объединят более 3 000 учителей и кураторов СПО. Вместе с известными спикерами они обсудят важные для современного образования темы.</p>

<p>Следить за трансляциями можно и в онлайн-режиме - в официальном сообществе ФКР и на сайте:<br />
<a href="https://vfkr.ru/">https://vfkr.ru/</a></p>', 'Директор', 1, 9, null, 'active', '2023-10-12 00:00:00', null, '2023-10-17 02:24:50', '2023-10-17 02:45:17');
INSERT INTO SAPI.news (id, title, description, text, author, news_category_id, album_id, source, status, pub_approve, video, created_at, updated_at) VALUES (6, 'Поддержим Марину Владимировну Булгакову', null, '<p>Поддержим Марину Владимировну Булгакову, учителя английского языка школы №9 из Вязников, в конкурсе &laquo;Учитель года России &ndash; 2023&raquo;!</p>

<p>Минпросвещения открывает специальный чат-бот, в котором можно будет поддержать педагогов-участников. Отдать свой голос можно только за одного претендента. 33 регион представляет Марина Булгакова.</p>

<h2>Сделать это можно здесь <a href="https://vk.com/write-30558759">https://vk.com/write-30558759</a></h2>

<p>Онлайн-голосование завершится 3 октября в 12:00 по московскому времени. Организаторами проекта выступают Минпросвещения России и Центр компетенций в сфере интернет-коммуникаций &laquo;Диалог&raquo; при поддержке коммуникационного сервиса &laquo;Сферум&raquo;.</p>

<p>Итоги голосования будут подведены на торжественной церемонии закрытия второго тура заключительного этапа Всероссийского конкурса &laquo;Учитель года России &ndash; 2023&raquo; в Московской области.</p>

<p>&nbsp;</p>', 'Директор', 1, 10, null, 'active', '2023-09-27 00:00:00', 'https://vk.com/video-179950459_456239726', '2023-10-17 02:28:01', '2023-10-17 02:28:01');
