<?php

namespace App\Http\Controllers;

use Illuminate\Database\Eloquent\Casts\Json;
use Illuminate\Foundation\Auth\Access\AuthorizesRequests;
use Illuminate\Foundation\Validation\ValidatesRequests;
use Illuminate\Routing\Controller as BaseController;
use Illuminate\Support\Facades\Storage;

class Controller extends BaseController
{
    use AuthorizesRequests, ValidatesRequests;

    protected function getSchedule()
    {
//        $jsonUserData =  '{
//    "сlass_1": {
//        "monday": {
//            "lesson_1": "Разговоры о важном",
//            "lesson_2": "Литературное чтение",
//            "lesson_3": "Русский язык",
//            "lesson_4": "Физическая культура"
//        },
//        "tuesday": {
//            "lesson_1": "Литературное чтение",
//            "lesson_2": "Русский язык",
//            "lesson_3": "Математика",
//            "lesson_4": "Окружающий мир",
//            "lesson_5": "Технология",
//            "lesson_6": "Осмысленное чтение"
//        },
//        "wednesday": {
//            "lesson_1": "Литературное чтение",
//            "lesson_2": "Русский язык",
//            "lesson_3": "ИЗО",
//            "lesson_4": "Математика",
//            "lesson_5": "Осмысленное чтение"
//        },
//        "thursday": {
//            "lesson_1": "Математика",
//            "lesson_2": "Физическая культура",
//            "lesson_3": "Окружающий мир",
//            "lesson_4": "Русский язык"
//        },
//        "friday": {
//            "lesson_1": "Литературное чтение",
//            "lesson_2": "Русский язык",
//            "lesson_3": "Математика",
//            "lesson_4": "Музыка"
//        }
//    },
//
//    "сlass_2": {
//        "monday": {
//            "lesson_1": "Разговоры о важном",
//            "lesson_2": "Русский язык",
//            "lesson_3": "Математика",
//            "lesson_4": "Технология",
//            "lesson_5": "Литературное чтение"
//        },
//        "tuesday": {
//            "lesson_1": "Математика",
//            "lesson_2": "Немецкий",
//            "lesson_3": "Физическая культура",
//            "lesson_4": "Русский язык",
//            "lesson_5": "Род яз/лит",
//            "lesson_6": "Осмысленное чтение"
//        },
//        "wednesday": {
//            "lesson_1": "Русский язык",
//            "lesson_2": "Музыка",
//            "lesson_3": "Математика",
//            "lesson_4": "Лингвистический практикум по иностр. языку",
//            "lesson_5": "Литературное чтение",
//            "lesson_6": "Осмысленное чтение"
//        },
//        "thursday": {
//            "lesson_1": "Русский язык",
//            "lesson_2": "Литературное чтение",
//            "lesson_3": "Немецкий",
//            "lesson_4": "Физическая культура",
//            "lesson_5": "Окружающий мир"
//        },
//        "friday": {
//            "lesson_1": "Математика",
//            "lesson_2": "Литературное чтение",
//            "lesson_3": "Окружающий мир",
//            "lesson_4": "ИЗО"
//        }
//    },
//
//    "сlass_3": {
//        "monday": {
//            "lesson_1": "Разговоры о важном",
//            "lesson_2": "Математика",
//            "lesson_3": "Литературное чтение",
//            "lesson_4": "Технология",
//            "lesson_5": "Физическая культура"
//        },
//        "tuesday": {
//            "lesson_1": "Музыка",
//            "lesson_2": "Математика",
//            "lesson_3": "Русский язык",
//            "lesson_4": "Окружающий мир",
//            "lesson_5": "Осмысленное чтение"
//        },
//        "wednesday": {
//            "lesson_1": "Лингвистический практикум по иностр. языку",
//            "lesson_2": "ИЗО",
//            "lesson_3": "Математика",
//            "lesson_4": "Русский язык",
//            "lesson_5": "Литературное чтение",
//            "lesson_6": "Осмысленное чтение"
//        },
//        "thursday": {
//            "lesson_1": "Русский язык",
//            "lesson_2": "Немецкий",
//            "lesson_3": "Математика",
//            "lesson_4": "Физическая культура",
//            "lesson_5": "Литературное чтение"
//        },
//        "friday": {
//            "lesson_1": "Русский язык",
//            "lesson_2": "Литературное чтение",
//            "lesson_3": "Окружающий мир",
//            "lesson_4": "Технология",
//            "lesson_5": "Немецкий"
//        }
//    },
//
//    "сlass_4": {
//        "monday": {
//            "lesson_1": "Разговоры о важном",
//            "lesson_2": "Технология",
//            "lesson_3": "Русский язык",
//            "lesson_4": "Математика",
//            "lesson_5": "Осмысленное чтение"
//        },
//        "tuesday": {
//            "lesson_1": "Русский язык",
//            "lesson_2": "Литературное чтение",
//            "lesson_3": "Немецкий",
//            "lesson_4": "Математика",
//            "lesson_5": "Окружающий мир",
//            "lesson_6": "Осмысленное чтение"
//        },
//        "wednesday": {
//            "lesson_1": "Русский язык",
//            "lesson_2": "Физическая культура",
//            "lesson_3": "Литературное чтение",
//            "lesson_4": "Математика",
//            "lesson_5": "Музыка"
//        },
//        "thursday": {
//            "lesson_1": "Литературное чтение",
//            "lesson_2": "Математика",
//            "lesson_3": "Лингвистический практикум по иностр. языку",
//            "lesson_4": "Русский язык",
//            "lesson_5": "ИЗО"
//        },
//        "friday": {
//            "lesson_1": "Литературное чтение",
//            "lesson_2": "Физическая культура",
//            "lesson_3": "Немецкий",
//            "lesson_4": "Окружающий мир",
//            "lesson_5": "ОРКСЭ"
//        }
//    },
//
//    "сlass_5": {
//    "monday": {
//        "lesson_1": "Разговоры о важном",
//            "lesson_2": "Литература",
//            "lesson_3": "Английский",
//            "lesson_4": "Физическая культура",
//            "lesson_5": "Математика",
//            "lesson_6": "Русский язык"
//        },
//        "tuesday": {
//        "lesson_1": "Физическая культура",
//            "lesson_2": "Математика",
//            "lesson_3": "Английский",
//            "lesson_4": "Русский язык",
//            "lesson_5": "Литература",
//            "lesson_6": "История"
//        },
//        "wednesday": {
//        "lesson_1": "Русский язык",
//            "lesson_2": "Немецкий",
//            "lesson_3": "Математика",
//            "lesson_4": "Русский язык",
//            "lesson_5": "Литература",
//            "lesson_6": "Математика"
//        },
//        "thursday": {
//        "lesson_1": "Математика",
//            "lesson_2": "Русский язык",
//            "lesson_3": "История",
//            "lesson_4": "ОДНКНР",
//            "lesson_5": "Немецкий",
//            "lesson_6": "География"
//        },
//        "friday": {
//        "lesson_1": "Музыка",
//            "lesson_2": "ИЗО",
//            "lesson_3": "Технология",
//            "lesson_4": "Технология",
//            "lesson_5": "Биология",
//            "lesson_6": "Английский"
//        }
//    },
//
//    "сlass_6": {
//    "monday": {
//        "lesson_1": "Разговоры о важном",
//            "lesson_2": "Биология",
//            "lesson_3": "Английский",
//            "lesson_4": "Английский",
//            "lesson_5": "Литература",
//            "lesson_6": "Математика"
//        },
//        "tuesday": {
//        "lesson_1": "Обществознание",
//            "lesson_2": "Математика",
//            "lesson_3": "Физическая культура",
//            "lesson_4": "История",
//            "lesson_5": "Музыка",
//            "lesson_6": "Русский язык"
//        },
//        "wednesday": {
//        "lesson_1": "Математика",
//            "lesson_2": "Информационная грамотность",
//            "lesson_3": "Литература",
//            "lesson_4": "История",
//            "lesson_5": "Физическая культура",
//            "lesson_6": "Русский язык"
//        },
//        "thursday": {
//        "lesson_1": "Русский язык",
//            "lesson_2": "ОДНКНР",
//            "lesson_3": "География",
//            "lesson_4": "Математика",
//            "lesson_5": "Математика",
//            "lesson_6": "Технология"
//        },
//        "friday": {
//        "lesson_1": "Немецкий",
//            "lesson_2": "Русский язык",
//            "lesson_3": "Немецкий",
//            "lesson_4": "Литература",
//            "lesson_5": "Математика",
//            "lesson_6": "Русский язык"
//        }
//    },
//
//    "сlass_7": {
//    "monday": {
//        "lesson_1": "Разговоры о важном",
//            "lesson_2": "Немецкий",
//            "lesson_3": "Обществознание",
//            "lesson_4": "Физика",
//            "lesson_5": "Музыка",
//            "lesson_6": "Русский язык"
//        },
//        "tuesday": {
//        "lesson_1": "География",
//            "lesson_2": "Немецкий",
//            "lesson_3": "Технология",
//            "lesson_4": "Немецкий",
//            "lesson_5": "Математика",
//            "lesson_6": "Биология"
//        },
//        "wednesday": {
//        "lesson_1": "Математика",
//            "lesson_2": "Физика",
//            "lesson_3": "Английский",
//            "lesson_4": "Немецкий",
//            "lesson_5": "Русский язык",
//            "lesson_6": "Физическая культура"
//        },
//        "thursday": {
//        "lesson_1": "Информатика",
//            "lesson_2": "Русский язык",
//            "lesson_3": "Русский язык",
//            "lesson_4": "Математика",
//            "lesson_5": "Биология",
//            "lesson_6": "Физическая культура"
//        },
//        "friday": {
//        "lesson_1": "Литература",
//            "lesson_2": "История",
//            "lesson_3": "Немецкий",
//            "lesson_4": "Математика",
//            "lesson_5": "Английский",
//            "lesson_6": "История"
//        }
//    },
//
//    "сlass_8": {
//    "monday": {
//        "lesson_1": "Разговоры о важном",
//            "lesson_2": "Английский",
//            "lesson_3": "Математика",
//            "lesson_4": "Немецкий",
//            "lesson_5": "География",
//            "lesson_6": "История"
//        },
//        "tuesday": {
//        "lesson_1": "Биология",
//            "lesson_2": "География",
//            "lesson_3": "Информатика",
//            "lesson_4": "История",
//            "lesson_5": "Обществознание",
//            "lesson_6": "Русский язык"
//        },
//        "wednesday": {
//        "lesson_1": "Химия",
//            "lesson_2": "Английский",
//            "lesson_3": "Математика",
//            "lesson_4": "Черчение",
//            "lesson_5": "Немецкий",
//            "lesson_6": "ОБЖ"
//        },
//        "thursday": {
//        "lesson_1": "Русский язык",
//            "lesson_2": "Аглийский",
//            "lesson_3": "Математика",
//            "lesson_4": "Физическая культура",
//            "lesson_5": "Литература",
//            "lesson_6": "Физика"
//        },
//        "friday": {
//        "lesson_1": "Биология",
//            "lesson_2": "Математика",
//            "lesson_3": "Русский язык",
//            "lesson_4": "Физика",
//            "lesson_5": "Химия",
//            "lesson_6": "Литература"
//        }
//    },
//
//    "сlass_9": {
//    "monday": {
//        "lesson_1": "Разговоры о важном",
//            "lesson_2": "Информатика",
//            "lesson_3": "Математика",
//            "lesson_4": "Математика",
//            "lesson_5": "Физика",
//            "lesson_6": "Химия"
//        },
//        "tuesday": {
//        "lesson_1": "Литература",
//            "lesson_2": "Математика",
//            "lesson_3": "Русский язык",
//            "lesson_4": "Немецкий",
//            "lesson_5": "Математика",
//            "lesson_6": "Английский"
//        },
//        "wednesday": {
//        "lesson_1": "Русский язык",
//            "lesson_2": "Физическая культура",
//            "lesson_3": "География",
//            "lesson_4": "Математика",
//            "lesson_5": "Английский",
//            "lesson_6": "История"
//        },
//        "thursday": {
//        "lesson_1": "Русский язык",
//            "lesson_2": "Физика",
//            "lesson_3": "Литература",
//            "lesson_4": "Немецкий",
//            "lesson_5": "Физическая культура",
//            "lesson_6": "История"
//        },
//        "friday": {
//        "lesson_1": "Литература",
//            "lesson_2": "Английский",
//            "lesson_3": "Математика",
//            "lesson_4": "Математика",
//            "lesson_5": "Химия",
//            "lesson_6": "Обществознание"
//        }
//    },
//
//    "сlass_10": {
//    "monday": {
//        "lesson_1": "Русский язык",
//            "lesson_2": "Физическая культура",
//            "lesson_3": "География",
//            "lesson_4": "Математика",
//            "lesson_5": "Английский",
//            "lesson_6": "История"
//        },
//        "tuesday": {
//        "lesson_1": "Литература",
//            "lesson_2": "Английский",
//            "lesson_3": "Математика",
//            "lesson_4": "Математика",
//            "lesson_5": "Химия",
//            "lesson_6": "Обществознание"
//        },
//        "wednesday": {
//        "lesson_1": "Разговоры о важном",
//            "lesson_2": "Информатика",
//            "lesson_3": "Математика",
//            "lesson_4": "Математика",
//            "lesson_5": "Физика",
//            "lesson_6": "Химия"
//        },
//        "thursday": {
//        "lesson_1": "Русский язык",
//            "lesson_2": "Физика",
//            "lesson_3": "Литература",
//            "lesson_4": "Немецкий",
//            "lesson_5": "Физическая культура",
//            "lesson_6": "История"
//        },
//        "friday": {
//        "lesson_1": "Литература",
//            "lesson_2": "Математика",
//            "lesson_3": "Русский язык",
//            "lesson_4": "Немецкий",
//            "lesson_5": "Математика",
//            "lesson_6": "Английский"
//        }
//    },
//
//    "сlass_11": {
//        "monday": {
//            "lesson_1": "Разговоры о важном",
//            "lesson_2": "Информатика",
//            "lesson_3": "Математика",
//            "lesson_4": "Математика",
//            "lesson_5": "Физика",
//            "lesson_6": "Химия"
//        },
//        "tuesday": {
//            "lesson_1": "Русский язык",
//            "lesson_2": "Физическая культура",
//            "lesson_3": "География",
//            "lesson_4": "Математика",
//            "lesson_5": "Английский",
//            "lesson_6": "История"
//        },
//        "wednesday": {
//            "lesson_1": "Литература",
//            "lesson_2": "Английский",
//            "lesson_3": "Математика",
//            "lesson_4": "Математика",
//            "lesson_5": "Химия",
//            "lesson_6": "Обществознание"
//        },
//        "thursday": {
//            "lesson_1": "Литература",
//            "lesson_2": "Математика",
//            "lesson_3": "Русский язык",
//            "lesson_4": "Немецкий",
//            "lesson_5": "Математика",
//            "lesson_6": "Английский"
//        },
//        "friday": {
//            "lesson_1": "Русский язык",
//            "lesson_2": "Физика",
//            "lesson_3": "Литература",
//            "lesson_4": "Немецкий",
//            "lesson_5": "Физическая культура",
//            "lesson_6": "История"
//        }
//    }
//}';
        $jsonUserData = Storage::disk('public')->get('schedule.json');

        return  json_decode($jsonUserData, true);
    }

    protected function getClasses (): array
    {
        $arrayUserData = $this->getSchedule();
        foreach ($arrayUserData as $key => $item) {
            $arrayClasses[] = $key;
        }
       return $arrayClasses;
    }
}
